
#__________________________________________________________________________________________________출력 포맷
#빈 자리 빈공간, 우정렬 
print("{0:>10}".format(500))
# 양수일땐 +표시, 음수 일땐 -로 표시 
print("{0:>+10}".format(500))
print("{0:>+10}".format(-500))
#왼쪽정령, 빈칸 _ 로 채움
print("{0:_<+10}".format(500))
# 3자리 마다 콤마 찍기
print("{0:,}".format(100000000000000))
# 3자리 마다 콤마 찍기 +- 부호도
print("{0:+,}".format(100000000000000))
# 3자리 마다 콤마 찍기, 부호 , 자릿수 확보, 빈자리는^
print("{0:^<+30,}".format(100000000))
# 소숫점
print("{0:f}".format(5/3))
# 소숫점 특정자리수 까지만
print("{0:.2f}".format(5/3))